{
    "staff": [
        {
            "staff_id": "staff_1751918420_686c27545acb0",
            "name": "Dean Kianne",
            "image_path": "portraits\/staff_1751918420_686c27545acb0_portrait_1751918475.png",
            "college": "Quandrix",
            "character_description": "Dean of substance",
            "general_info": "Dean of substance",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Brilliant and eccentric, Dean Kianne (neutral elf **[Quandrix professor of substance](http:\/\/journal.roll20.net\/character\/-MlWffK02KOkWHw426G6)**) is one of the preeminent mana scholars of the world. She has visited and studied countless bizarre magical phenomena, from snarls to star arches to ancient shrines. She loves to share her wild theories with anyone who will listen.\r\n\r\nKianne believes in using mathematics to better understand nature. She places an emphasis on practical magic that improves daily life through applied calculations. She rolls her eyes at Dean Imbraham’s theories, dismissing them as evidence that her fellow dean lives in an imaginary world."
            }
        },
        {
            "staff_id": "staff_1751918492_686c279c945f8",
            "name": "Dean Imbraham",
            "image_path": "portraits\/staff_1751918492_686c279c945f8_portrait_1751918547.png",
            "college": "Quandrix",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Dean Imbraham (neutral owlin **[Quandrix professor of theory](http:\/\/journal.roll20.net\/character\/-MlWfhwXxlk8_PfjDn6O)**) is stern and shrewd, with a mind as piercing as his curved beak. He is known for the unnerving habit of fully rotating his head around to address his students, while still rapidly chalking up complex theorems and equations on a chalkboard. Imbraham loves numbers more than people or the out-of-doors; some say he hasn’t gone outside certain chambers of the Quandrix campus in years.\r\n\r\nImbraham wants nothing more than to crack the mysteries of the world through dauntingly complex theories. He offers his students standing bounties on any of his unsolved equations."
            }
        },
        {
            "staff_id": "staff_1751918556_686c27dc1ed40",
            "name": "Adrix and Nev",
            "image_path": "portraits\/staff_1751918556_686c27dc1ed40_portrait_1751918561.png",
            "college": "Quandrix",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "The twins Adrix (neutral good triton **Quandrix professor of substance**) and Nev (neutral good triton **Quandrix professor of theory**) grew up literally swimming in magic, in an ocean region near a powerful magical snarl. At an early age, they began to see patterns in the tides and currents that eluded even the most esteemed scholars of their society. Once, they saved a hundred lives by predicting the sudden arrival of a tsunami, despite the deceptively calm seas—washing away any doubts in their prowess.\r\n\r\nAdrix and Nev now teach as a duo, blending mastery of both of Quandrix’s philosophical perspectives. They constantly debate the merits of various esoteric mathematical principles, but if one of their students is in danger, they leap into action in perfect harmony."
            }
        },
        {
            "staff_id": "staff_1751918579_686c27f3e0e2a",
            "name": "Deekah",
            "image_path": "portraits\/staff_1751918579_686c27f3e0e2a_portrait_1751918615.png",
            "college": "Quandrix",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Deekah (lawful neutral human **Quandrix professor of theory**) sees the world as an endless sequence of interconnected equations, which to her is the most beautiful thing imaginable. She explores new theorems by giving them physical form, and her exquisite geometric creations are thrilling sights on campus."
            }
        },
        {
            "staff_id": "staff_1751918630_686c2826f394b",
            "name": "Ruxa",
            "image_path": "portraits\/staff_1751918630_686c2826f394b_portrait_1751918666.png",
            "college": "Quandrix",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Ruxa (neutral good **Quandrix professor of substance**) looks like a bipedal brown bear and knows that wild new theories, though exciting, are worthless without a deep understanding of the basics. He teaches students of all levels, and even his most experienced pupils benefit from a much deeper understanding of the fundamental building blocks of the world."
            }
        },
        {
            "staff_id": "staff_1751918689_686c2861a3fba",
            "name": "Dean Uvilda Mistcoiler",
            "image_path": "portraits\/staff_1751918689_686c2861a3fba_portrait_1751918720.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Uvilda Mistcoiler (neutral good genasi Prismari professor of perfection is the current Dean of Perfection. A master of artistic technique, Uvilda trains with a range of elements whenever she isn’t focused on her teaching. She is known for giving students profoundly insightful feedback, which she tailors to each individual. After a review, she often offers a small piece of advice that alters the student’s point of view and work forever—for the better.\r\n\r\nUvilda believes that good art comes from the head. To her, carefully measured strokes and deliberate object placement make the difference between fully realized art and a total mess. If Dean Nassari interrupts her careful work with bombastic expressions one more time, Uvilda is prepared to enroll in Quandrix college to learn how to shrink Nassari."
            }
        },
        {
            "staff_id": "staff_1751918741_686c2895cc989",
            "name": "Dean Nassari",
            "image_path": "portraits\/staff_1751918741_686c2895cc989_portrait_1751918771.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Nassari (chaotic good genasi Prismari professor of expression is the current Dean of Expression. Nazzari always want to see art that is bigger, more radical in concept, and more emotionally powerful. For their final project as a mage-student, Nassari famously “turned in” an earthquake, which almost destroyed three campus buildings. The piece received a standing ovation from the mage-student body—and a grumpy thumbs down from the campus construction golems.\r\n\r\nNassari believes that true expression comes from the heart. They encourage their students to treat the entire world as a canvas on which to spread emotion and excitement. Nassari takes little heed of Dean Mistcoiler’s quiet masterpieces and often feigns forgetfulness about Dean Mistcoiler’s very existence."
            }
        },
        {
            "staff_id": "staff_1751918786_686c28c2c36ee",
            "name": "Veyran",
            "image_path": "portraits\/staff_1751918786_686c28c2c36ee_portrait_1751918811.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "In addition to being an accomplished elementalist, Veyran (chaotic good genasi **Prismari professor of perfection**) serves as a mentor to many Prismari pledgemages. She advocates enthusiastically for the importance of both passion and disciplined technique in any artistic pursuit. If a new student is upset or overwhelmed, she eagerly calls forth playful, beautiful elemental creatures to cheer up the student."
            }
        },
        {
            "staff_id": "staff_1751918829_686c28ed66ee7",
            "name": "Zaffai",
            "image_path": "portraits\/staff_1751918829_686c28ed66ee7_portrait_1751918853.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "As soon as Zaffai (chaotic neutral human **Prismari professor of expression**) came of age, his parents sent him to Strixhaven, assuring him his budding musical genius deserved the finest instruction in the world. (In truth, though he did possess prodigious talent, they were also growing tired of their house being randomly struck by lightning or engulfed in cyclones whenever he practiced.) Even as he flourished as both mage and musician, he discovered a new aptitude: conducting.\r\n\r\nIn addition to teaching, he serves as Grand Maestro of Strixhaven’s Orchestra of the Arcane, an elite extracurricular activity for top Prismari students. They practice only outdoors, and their concerts fill the sky with beautiful explosions of elemental magic."
            }
        },
        {
            "staff_id": "staff_1751918862_686c290e0f5c6",
            "name": "Arkin Minexes",
            "image_path": "portraits\/staff_1751918862_686c290e0f5c6_portrait_1751918894.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Arkin (lawful good human **Prismari professor of expression**) is a newly hired instructor teaching a few courses in choreography and dance ensembles. He recently graduated from Strixhaven himself, and he bubbles with excitement at the prospect of guiding a new generation of students on the course of study he so greatly enjoyed. He particularly delights in finding new ways to help students work collaboratively to unlock the heights of their creative potential."
            }
        },
        {
            "staff_id": "staff_1751918903_686c293708b64",
            "name": "Octavia",
            "image_path": "portraits\/staff_1751918903_686c293708b64_portrait_1751918928.png",
            "college": "Prismari",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Crafted as a graduate’s final project many years ago, Octavia (a **[water elemental](http:\/\/journal.roll20.net\/character\/-MlWmDiOSV7iLyWeiosy)** that looks like an enormous octopus) took up residence on campus and never left. After all, in its humble opinion, every student deserves the chance to see true art in person. Some say it’s incoherent, but really, Octavia is just a very conceptual thinker."
            }
        },
        {
            "staff_id": "staff_1751918949_686c2965cf6c8",
            "name": "Dean Augusta Tullus",
            "image_path": "portraits\/staff_1751918949_686c2965cf6c8_portrait_1751918999.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Augusta Tullus (lawful neutral human **[Lorehold professor of order](http:\/\/journal.roll20.net\/character\/-MlVua3igOsInXJOeICN)**) is the current Dean of Order. A professor of spirit studies, she has been called the college’s most talented pastraiser. She can conjure entire legions of ghostly apparitions to reenact historical events for her lectures.\r\n\r\nAugusta believes that history repeats itself as an orderly progression toward an ideal. In her view, the mistakes of the past can inform the choices of the present, creating a world of peace and order. She plays things by the book and frowns on students who embark on Dean Plargg’s dangerous field trips.\r\n\r\nCharacters have ample opportunity to meet Dean Tullus in the The Magister's Masquerade adventure."
            }
        },
        {
            "staff_id": "staff_1751919009_686c29a104c8a",
            "name": "Dean Plargg",
            "image_path": "portraits\/staff_1751919009_686c29a104c8a_portrait_1751919030.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Plargg (chaotic good orc **[Lorehold professor of chaos](http:\/\/journal.roll20.net\/character\/-MlVudhBAE9MlN9FoNSI)**) is the current Dean of Chaos. Specializing in military history, Plargg is known for his perfect recall of historical stories, as well as his potent scroll magic. Blind himself, he invented a form of magical embossing called heat lettering, which provides a tactile way to read texts.\r\n\r\nPlargg believes that history is full of unpredictable, war-filled chaos and that his students must be ready for anything. He teaches that no rewards come without risk, and his excursions typically end with students heading to the infirmary. He pays little attention to Dean Tullus’s work, usually dismissing her attempts to find order in chaos as foolhardy."
            }
        },
        {
            "staff_id": "staff_1751919070_686c29de92a0e",
            "name": "Hofri Ghostforge",
            "image_path": "portraits\/staff_1751919070_686c29de92a0e_portrait_1751919099.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "When Hofri (neutral good dwarf **Lorehold professor of order**) first enrolled in Strixhaven, he believed his future lay with Prismari. A diligent student, he quickly mastered the technical skills of art, but his magic left something to be desired. After talking with the school’s counselor, Mavinda, Hofri decided to try his luck with Lorehold. It turned out he had a natural talent for Lorehold’s spirit magic.\r\n\r\nHis time at Prismari was hardly wasted, however. Combining his artistic skill with his keen spiritual sense, Hofri could visualize a spirit’s mortal appearance and construct a viable statue form for them to inhabit. No one in Lorehold’s history had previously created a spirit statue from scratch, and Hofri was offered a professorial position after graduation, which he happily accepted."
            }
        },
        {
            "staff_id": "staff_1751919185_686c2a511ee7d",
            "name": "Osgir",
            "image_path": "portraits\/staff_1751919185_686c2a511ee7d_portrait_1751919210.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Even by Lorehold standards, Osgir (neutral **stone giant**) is obsessed with relics of the past. A professor of order, he treasures every connection to old civilizations, whether it’s a magnificent jeweled crown or an old shovel. As a student, he constantly spent time in detention for hoarding the best finds from Lorehold dig sites in his room; he lost count of how many times he was sternly told, “History belongs to us all!”\r\n\r\nSo, naturally, he mastered the magical art of duplicative restoration. Not only can he perfectly recreate an ancient object or device from the smallest scrap, but he can also produce a second, identical version for his personal collection. He displays something different every week in his Lorehold office, from a mighty sword of demon-slaying to a delicate elven music box."
            }
        },
        {
            "staff_id": "staff_1751919226_686c2a7aca832",
            "name": "Losheel",
            "image_path": "portraits\/staff_1751919226_686c2a7aca832_portrait_1751919242.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Losheel (chaotic good loxodon **Lorehold professor of chaos**) is a Humanoid resembling a bipedal elephant. She proudly admits that she is willing to work hard to be as lazy as possible. She turns her brilliant mind to constructing increasingly efficient mechanical helpers, with the goal of one day being able to do anything she wants without standing up."
            }
        },
        {
            "staff_id": "staff_1751919266_686c2aa2e1e13",
            "name": "Golwanda",
            "image_path": "portraits\/staff_1751919266_686c2aa2e1e13_portrait_1751919287.png",
            "college": "Lorehold",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "“Have you met Golwanda yet?” is a question that older Lorehold students love to ask second-year students, new to the college. Sooner or later, one professor or another summons this spirit of a notorious stone giant warmonger, ostensibly as a cautionary tale about the dire fate that befalls a society that loses control of its aggressive impulses. Golwanda plays her role with relish, doing her best to strike terror into the students with her bloodcurdling screams and howls of rage.The heart of Lorehold College overlooks a chasm littered with ancient ruins."
            }
        },
        {
            "staff_id": "staff_1751919316_686c2ad4b95bc",
            "name": "Dean Lissette",
            "image_path": "portraits\/staff_1751919316_686c2ad4b95bc_portrait_1751919345.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919372_686c2b0c38da1",
            "name": "Dean Valentin",
            "image_path": "portraits\/staff_1751919372_686c2b0c38da1_portrait_1751919399.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919411_686c2b33e0977",
            "name": "Willowdusk",
            "image_path": "portraits\/staff_1751919411_686c2b33e0977_portrait_1751919432.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919446_686c2b56e364f",
            "name": "Tivash",
            "image_path": "portraits\/staff_1751919446_686c2b56e364f_portrait_1751919476.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919453_686c2b5d52395",
            "name": "Verelda Lang",
            "image_path": "portraits\/staff_1751919453_686c2b5d52395_portrait_1751919507.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919514_686c2b9a7afc6",
            "name": "Yendora",
            "image_path": "portraits\/staff_1751919514_686c2b9a7afc6_portrait_1751919539.png",
            "college": "Witherbloom",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919562_686c2bca4b232",
            "name": "Gyome",
            "image_path": "portraits\/staff_1751919562_686c2bca4b232_portrait_1751919575.png",
            "college": "",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919596_686c2bec988d3",
            "name": "Dean Shaile Talonrook",
            "image_path": "portraits\/staff_1751919596_686c2bec988d3_portrait_1751919625.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919640_686c2c182dad5",
            "name": "Dean Embrose Lu",
            "image_path": "portraits\/staff_1751919640_686c2c182dad5_portrait_1751919669.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919677_686c2c3d97abc",
            "name": "Breena",
            "image_path": "portraits\/staff_1751919677_686c2c3d97abc_portrait_1751919698.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919708_686c2c5c91d14",
            "name": "Nils",
            "image_path": "portraits\/staff_1751919708_686c2c5c91d14_portrait_1751919736.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919749_686c2c8500c2d",
            "name": "Brenneth Blackstone",
            "image_path": "portraits\/staff_1751919749_686c2c8500c2d_portrait_1751919777.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1751919785_686c2ca9b7a47",
            "name": "Fain",
            "image_path": "portraits\/staff_1751919785_686c2ca9b7a47_portrait_1751919813.png",
            "college": "Silverquill",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": ""
            }
        },
        {
            "staff_id": "staff_1752088435_686ebf73e5045",
            "name": "Old Nam",
            "image_path": "portraits\/staff_1752088435_686ebf73e5045_portrait_1752088587.png",
            "college": "",
            "character_description": "",
            "general_info": "",
            "favorites": [],
            "gm_only": {
                "personality": "",
                "other": "Caretaker of Frunk in his childhood. Doesn't speak Common. She isn't smart but just puts her head down and works. She cleans for him and sleeps under the bed in his room. "
            }
        }
    ],
    "metadata": {
        "last_updated": "2025-07-09 19:21:22",
        "total_staff": 31
    }
}